In [1]:
%load_ext sql
%sql sqlite:///Baloncesto_Guille.db

/usr/local/lib/python3.5/dist-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/usr/local/lib/python3.5/dist-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

'Connected: None@Baloncesto_Guille.db'

In [13]:
%%sql
CREATE TABLE Comunidades_Autonomas
(nombre VARCHAR(30),
 PRIMARY KEY (nombre)
);

Done.
Done.

[]

In [14]:
%%sql
CREATE TABLE Ciudades(nombre VARCHAR(30), 
                      comunidad_autonoma VARCHAR(30) NOT NULL, 
                      PRIMARY KEY(nombre, comunidad_autonoma),
                      FOREIGN KEY(comunidad_autonoma) REFERENCES Comunidades_Autonomas(nombre) ON DELETE CASCADE);

Done.
Done.

[]

In [15]:
%%sql
CREATE TABLE Equipos(nombre VARCHAR(30),
                     ciudad VARCHAR(30) NOT NULL,
                     comunidad_autonoma VARCHAR(30) NOT NULL,
                     PRIMARY KEY (nombre, ciudad, comunidad_autonoma),
                     FOREIGN KEY(ciudad) REFERENCES Ciudades(nombre), 
                     FOREIGN KEY(comunidad_autonoma) REFERENCES Comunidades_Autonomas(nombre));

Done.
Done.

[]

In [16]:
%%sql
INSERT INTO Equipos(nombre, ciudad, comunidad_autonoma) VALUES ('Estudiantes', 'Madrid', 'Comunidad de Madrid');
INSERT INTO Equipos(nombre, ciudad, comunidad_autonoma) VALUES ('Estudiantes', 'Pontevedra', 'Galicia');
INSERT INTO Equipos(nombre, ciudad, comunidad_autonoma) VALUES ('DKV', 'Badalona', 'Cataluña');
INSERT INTO Equipos(nombre, ciudad, comunidad_autonoma) VALUES ('Bilbao Basquet', 'Bilbao', 'Pais Vasco');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%sql SELECT * FROM Equipos;

Done.

[('Estudiantes', 'Madrid', 'Comunidad de Madrid'),
 ('Estudiantes', 'Pontevedra', 'Galicia'),
 ('DKV', 'Badalona', 'Cataluña'),
 ('Bilbao Basquet', 'Bilbao', 'Pais Vasco')]

In [21]:
%%sql
CREATE TABLE Empresas(nombre VARCHAR(30),
                     cif VARCHAR(10),
                     PRIMARY KEY (cif));

Done.
Done.

[]

In [61]:
%%sql
CREATE TABLE Jugadores(nif VARCHAR(10),
                       nombre VARCHAR(30),
                       apellidos VARCHAR(30),
                       fecha_nacimiento VARCHAR(30),
                       nombre_equipo VARCHAR(30),
                       PRIMARY KEY (nif),
                       FOREIGN KEY (nombre_equipo) REFERENCES Equipos(nombre));

Done.

[]

In [62]:
%%sql
INSERT INTO Jugadores(nif, nombre, apellidos, fecha_nacimiento, nombre_equipo) VALUES ('03456779X', 'Alberto', 'Estevez', '1991-04-03', 'Estudiantes');

1 rows affected.

[]

In [63]:
%sql SELECT * FROM Jugadores;

Done.

[('03456779X', 'Alberto', 'Estevez', '1991-04-03', 'Estudiantes')]

In [67]:
%%sql
CREATE TABLE Partidos(nombre VARCHAR(30),
                      fecha_comienzo VARCHAR(30),
                      fecha_fin VARCHAR(30),
                      nombre_jugador VARCHAR(30),
                      posicion VARCHAR(30),                      
                      PRIMARY KEY (nombre)
                      FOREIGN KEY (nombre_jugador) REFERENCES Jugadores(nombre));

Done.
Done.

[]

In [68]:
%%sql
SELECT * FROM Partidos;

Done.

[]